package zh

// code 规则
// 公共错误码码 0 - 99
// 业务错误码: 微服务 + 业务码 + 两位
// 比如: 2100
// 2 背包物品为服务
// 1 物品业务
// 00 业务错误码


var LangMap = map[int]string{

	0: "请求成功",
	1: "请求失败",
	2: "参数错误",
	3: "格式化数据错误",
	4 : "解析rpc请求参数失败",

	// 登录注册错误信息 1000~1999
	1000 : "用户登录失败请稍候重试",
	1001 : "缺少必须的字段无法验证用户信息",
	1002 : "用户信息验证失败请稍候重试",
	1003 : "该手机号已注册",
	1004 : "该游客账号已经绑定了其他微信账号",
	1005 : "微信访问令牌已过期",
	1006 : "验证码错误",
	1007 : "手机号码未设置密码，请使用验证码登录",
	1008 : "微信绑定手机号失败",
	1009 : "游客升级为手机号失败",
	1010 : "该游客已经升级过手机号了",
	1011 : "该微信已经绑定过手机号，请用手机号登录",
	1012 : "为了您的账号安全请重新登录",
	1013 : "用户绑定失败请稍候重试",
	1014 : "重置密码失败",
	1015 : "手机格式不正确",
	1016 : "密码错误，请用验证码登录",
	1017 : "请输入6-12数字字母或者符号的密码",
	1018 : "游客绑定微信失败",
	1019 : "该微信账号已使用，无法升级",
	1020 : "头像上传失败",
	1021 : "图片大小超出",

	// 物品背包错误信息 2000~2999

	2001 : "请求用户在线信息失败",
	2002 : "用户不在线",
	2010 : "物品在背包中未找到",
	2011 : "物品在背包中不可用",
	2012 : "物品在背包中已过期",
	2013 : "背包中物品兑换数量不够",
	2014 : "物品未找到",
	2015 : "物品类型错误",
	2016 : "礼包中的物品未找到",
	2017 : "从礼包新增物品失败",
	2018 : "兑换物品失败",
	2019 : "解析物品扩展字段失败",
	2020 : "不存在合成目标",
	2021 : "实物兑换失败",
	2022 : "背包标签获取失败",
	2023 : "获取最新物品失败",
	2024 : "获取背包物品列表失败",
	2025 : "使用物品成功,但是获取物品数量失败",

	2100: "获取物品信息失败",

}
